smartmeio/Adafruit_nRF52_Arduino/boards.txt
menu.softdevice=SoftDevice
menu.usbstack=USB Stack
menu.debug=Debug
menu.debug_output=Debug Output
menu.freertos=Use FreeRTOS

# ----------------------------------
# Arancino Volante
# ----------------------------------
arancinoVolante.name=Arancino Volante

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
arancinoVolante.vid.0=0x1915
arancinoVolante.pid.0=0x521F
arancinoVolante.vid.1=0x1915
arancinoVolante.pid.1=0x521F
arancinoVolante.vid.2=0x1915
arancinoVolante.pid.2=0x521F
arancinoVolante.vid.3=0x1915
arancinoVolante.pid.3=0x521F

# Upload
arancinoVolante.bootloader.tool=bootburn
arancinoVolante.upload.tool=nrfutil
arancinoVolante.upload.protocol=nrfutil
arancinoVolante.upload.use_1200bps_touch=true
arancinoVolante.upload.wait_for_upload_port=true
#arancinoVolante.upload.maximum_size=815104
arancinoVolante.upload.maximum_size=409600
arancinoVolante.upload.maximum_data_size=237568

# Build
arancinoVolante.build.mcu=cortex-m4
arancinoVolante.build.f_cpu=64000000
arancinoVolante.build.board=ARANCINO_VOLANTE
arancinoVolante.build.core=nRF5
arancinoVolante.build.variant=arancino_volante
arancinoVolante.build.usb_manufacturer="smartme.io"
arancinoVolante.build.usb_product="Arancino Volante"
arancinoVolante.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
arancinoVolante.build.ldscript=nrf52840_s140_v6.ld
arancinoVolante.build.vid=0x1915
arancinoVolante.build.pid=0x521F

# SofDevice Menu
arancinoVolante.menu.softdevice.s140v6=S140 6.1.1
arancinoVolante.menu.softdevice.s140v6.build.sd_name=s140
arancinoVolante.menu.softdevice.s140v6.build.sd_version=6.1.1
arancinoVolante.menu.softdevice.s140v6.build.sd_fwid=0xB6

# USB STACK
arancinoVolante.menu.usbstack.arduino=Arduino
arancinoVolante.menu.usbstack.tinyusb=TinyUSB
arancinoVolante.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Debug Menu
arancinoVolante.menu.debug.l0=Level 0 (Release)
arancinoVolante.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
arancinoVolante.menu.debug.l1=Level 1 (Error Message)
arancinoVolante.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
arancinoVolante.menu.debug.l2=Level 2 (Full Debug)
arancinoVolante.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
arancinoVolante.menu.debug.l3=Level 3 (Segger SystemView)
arancinoVolante.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
arancinoVolante.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
arancinoVolante.menu.debug_output.serial=Serial
arancinoVolante.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
arancinoVolante.menu.debug_output.serial1=Serial1
arancinoVolante.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
arancinoVolante.menu.debug_output.rtt=Segger RTT
arancinoVolante.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# FreeRTOS Menu
arancinoVolante.menu.freertos.yes=Yes
arancinoVolante.menu.freertos.yes.build.arancino_extra_flags=-DUSEFREERTOS
